tap 'caskroom/cask'
tap 'homebrew/binary'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/science'
tap 'neovim/neovim'
tap 'peco/peco'
tap 'sanemat/font'

brew 'Caskroom/cask/coteditor'
brew 'Caskroom/cask/evernote'
brew 'Caskroom/cask/freemind'
brew 'Caskroom/cask/iterm2'
brew 'Caskroom/cask/java'
brew 'Caskroom/cask/karabiner'
brew 'Caskroom/cask/kindle'
brew 'Caskroom/cask/kobito'
brew 'Caskroom/cask/seli'
brew 'Caskroom/cask/send-to-kindle'
brew 'Caskroom/cask/sequel-pro'
brew 'Caskroom/cask/sourcetree'
brew 'Caskroom/cask/totalfinder'
brew 'Caskroom/cask/virtualbox'
brew 'Caskroom/cask/xquartz'


brew 'ansible'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'boot2docker'
brew 'cairo'
brew 'caskroom/cask/brew-cask'
brew 'cloog'
brew 'cmake'
brew 'coreutils'
brew 'cscope'
brew 'csshx'
brew 'ctags'
brew 'czmq'
brew 'docker'
brew 'elasticsearch'
brew 'elixir'
brew 'erlang'
brew 'findutils'
brew 'fontconfig'
brew 'fontforge'
brew 'freetype'
brew 'gcc'
brew 'gdbm'
brew 'gettext'
# brew 'ghi'
brew 'git'
brew 'git-flow'
brew 'glib'
brew 'gmp'
brew 'go'
brew 'gobject-introspection'
brew 'graphviz'
brew 'growly'
brew 'harfbuzz'
brew 'homebrew/dupes/apple-gcc42'
brew 'homebrew/dupes/gdb'
brew 'homebrew/dupes/ncurses'
brew 'httpie'
brew 'hub'
brew 'icu4c'
brew 'imagemagick'
brew 'isl'
brew 'jpeg'
brew 'jq'
brew 'lame'
brew 'libevent'
brew 'libffi'
brew 'libmemcached'
brew 'libmpc'
brew 'libpng'
brew 'libsodium'
brew 'libtiff'
brew 'libtool'
brew 'libvo-aacenc'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'lua'
brew 'luajit'
brew 'macvim', args: ['custom-icons', 'with-lua', 'with-luajit']
brew 'memcached'
brew 'mercurial'
brew 'mobile-shell'
brew 'mongodb'
brew 'mpfr'
brew 'mysql'
brew 'neovim/neovim/neovim', args: ['HEAD']
brew 'nkf'
brew 'node'
brew 'nspr'
brew 'openssl'
brew 'ossp-uuid'
brew 'pandoc'
brew 'pango'
brew 'pcre'
brew 'peco'
brew 'phantomjs'
brew 'pixman'
brew 'pkg-config'
brew 'plantuml'
brew 'pngquant'
brew 'postgresql'
brew 'protobuf'
brew 'pstree'
brew 'python'
brew 'qt'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ruby'
brew 'ruby-build'
brew 'sanemat/font/ricty'
# brew 'sbt'
# brew 'scala'
brew 'snappy'
brew 'spidermonkey'
brew 'sqlite'
brew 'subversion'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
# brew 'tokyo-cabinet'
brew 'tree'
brew 'unixodbc'
brew 'vim', args: ['with-lua', 'with-luajit']
brew 'wget'
brew 'wxmac'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'zeromq'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-lovers'


# brew 'Caskroom/cask/'
# cask 'adobe-reader'
# cask 'appcleaner'
# cask 'bittorrent-sync'
# cask 'calibre'
# cask 'gimp'
# cask 'github'
# cask 'libreoffice'
# cask 'mactracker'
# cask 'spectacle'
# cask 'the-unarchiver'
# cask 'vagrant'
