tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'yamayo/ec2ssh'
# tap 'sanemat/font'
# tap 'neovim/neovim'
# tap 'rogual/neovim-dot-app'
# tap 'homebrew/binary'
# tap 'homebrew/boneyard'
# tap 'homebrew/dupes'
# tap 'homebrew/science'
# tap 'homebrew/services'
# tap 'homebrew/versions'

mas 'Xcode', id: 497799835
mas 'LINE', id: 539883307
mas '1Password', id: 443987910
mas 'Airmail 3', id: 918858936
mas 'BetterSnapTool', id: 417375580
mas 'CotEditor', id: 1024640650
mas 'GarageBand', id: 682658836
mas 'Keynote', id: 409183694
mas 'Mactracker', id: 430255202
mas 'Marked 2', id: 890031187
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'PopClip', id: 445189367
mas 'Slack', id: 803453959
mas 'Witch', id: 412485838
mas 'Wunderlist', id: 410628904
mas 'iMovie', id: 408981434

cask 'appcleaner'
cask 'astah-community'
cask 'caskroom/versions/java8'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'font-hack-nerd-font'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'istat-menus'
cask 'iterm2'
cask 'karabiner-elements'
cask 'launchbar'
cask 'libreoffice'
cask 'macvim'
cask 'microsoft-office'
cask 'postman'
cask 'sourcetree'
cask 'the-unarchiver'
cask 'totalfinder'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'xmind'
# cask 'freemind'
# cask 'diskwave'
# cask 'bettertouchtool'
# cask 'gimp'
# cask 'hammerspoon'
# cask 'minecraft'
# cask 'skype'
# cask 'teleport'



brew 'apache-spark'
brew 'autoconf'
brew 'autogen'
brew 'automake'
brew 'aws-elasticbeanstalk'
brew 'awscli'
brew 'coreutils'
brew 'csshx'
brew 'ctags'
brew 'dep' # Go dependency management tool
brew 'direnv'
brew 'ec2ssh'
brew 'elixir'
brew 'erlang'
brew 'findutils'
brew 'freetype' # for matplotlib
brew 'gcc' # for matplotlib
brew 'ghq'
brew 'git'
brew 'git-archive-all'
brew 'git-lfs'
brew 'go'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'libxml2'
brew 'libxslt'
brew 'lua'
brew 'luajit'
brew 'mas'
brew 'mecab'
brew 'mecab-ipadic'
brew 'moreutils'
brew 'mysql'
brew 'neovim'
brew 'nkf'
brew 'node'
brew 'nodenv'
brew 'nspr'
brew 'open-cobol'
brew 'open-cobol'
brew 'peco'
brew 'postgresql', restart_service: true
brew 'pstree'
brew 'python'
brew 'python3'
brew 'qt'
brew 'qt@5.5'
brew 'r'
brew 'reattach-to-user-namespace'
brew 'ruby'
brew 'ruby-build'
brew 'sqlite'
brew 'terminal-notifier'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'vim', args: ['with-luajit']
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-lovers'

# brew 'apple-gcc42'
# brew 'apr'
# brew 'apr-util'
# brew 'boost'
# brew 'cairo'
# brew 'chromedriver'
# brew 'cscope'
# brew 'embulk'
# brew 'fish'
# brew 'fontconfig'
# brew 'fontforge'
# brew 'gd'
# brew 'gdb'
# brew 'gettext'
# brew 'git-flow'
# brew 'glib'
# brew 'gmp'
# brew 'gobject-introspection'
# brew 'graphviz'
# brew 'growly'
# brew 'harfbuzz'
# brew 'httperf'
# brew 'icu4c'
# brew 'imagemagick'
# brew 'isl'
# brew 'jpeg'
# brew 'lame'
# brew 'libevent'
# brew 'libmemcached'
# brew 'libmpc'
# brew 'libsodium'
# brew 'libtool'
# brew 'libvo-aacenc'
# brew 'libyaml'
# brew 'macvim', args: ['with-lua', 'with-luajit']
# brew 'memcached'
# brew 'mercurial'
# brew 'mobile-shell'
# brew 'mpfr'
# brew 'ncurses'
# brew 'neovim-dot-app'
# brew 'oniguruma'
# brew 'ossp-uuid'
# brew 'pandoc'
# brew 'pango'
# brew 'phantomjs'
# brew 'pixman'
# brew 'plantuml'
# brew 'pngquant'
# brew 'postgresql@9.4'
# brew 'redis'
# brew 'rust' # NOTE: rustup でインストール
# brew 'sanemat/font/ricty', args: ['with-powerline']
# brew 'snappy'
# brew 'spidermonkey'
# brew 'subversion'
# brew 'unixodbc'
# brew 'utf8proc'
# brew 'wxmac'
# brew 'x264'
# brew 'xvid'
# brew 'xz'
# brew 'zplug'

# vim: ft=ruby
