# vim: ft=ruby

tap 'phinze/homebrew-cask'
brew 'brew-cask'

tap 'homebrew/science'

# casks
# cask 'google-chrome'


# Programming
brew 'scala'
brew 'sbt'
brew 'go'
brew 'lua'
brew 'ruby'
brew 'node'
brew 'python'
# brew 'R'
# brew 'gfortran' # depends r


# Tools
brew 'coreutils'
brew 'nkf'
brew 'tree'
brew 'pstree'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-lovers'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'wget'
brew 'imagemagick'
brew 'ctags'
brew 'the_silver_searcher'
brew 'terminal-notifier'
brew 'growly'
brew 'qt'
brew 'graphviz'
brew 'macvim'
brew 'vim'

# SCM
brew 'git'
brew 'git-flow'
brew 'hub'
brew 'tig'
brew 'subversion'
brew 'mercurial'


# DB
brew 'mysql'
brew 'postgresql'
brew 'sqlite'
brew 'redis'
# brew 'mongodb'
# brew 'groonga'

# libs, build tool
brew 'libxml2'
brew 'libyaml'
brew 'libxslt'
brew 'autoconf'
brew 'automake'
brew 'apple-gcc42'

# search engine
brew 'elasticsearch'

# nettle      pcre    readline
#  cscope  geoip    gnutls    icu4c   libgcrypt libtasn1     pixman
#  gettext     libgpg-error libtiff   pkg-config
#  erlang-r16      intltool   libgsf libtool   mpfr    openssl     portaudio
# cairo      fontconfig  isl   libiconv msgpack  openssl098      s3cmd
# cloog      fontforge    jpeg   libksba    p11-kit     s3sync
# cmake      freetype  glib    libevent   libmpc    neon    pango
